Revit 2024 API
SpatialFieldManager.LegendShowConfigurationName Property
 If true legend contains analysis configuration name.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool LegendShowConfigurationName { get; set; }
Visual Basic
Public Property LegendShowConfigurationName As Boolean
	Get
	Set
Visual C++
public:
property bool LegendShowConfigurationName {
	bool get ();
	void set (bool value);
}
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace